### Import required dependencies

In [49]:
import pandas as pd
import os
import numpy as np

## Deliverable 1: Collect the Data

To collect the data that you’ll need, complete the following steps:

1. Using the Pandas `read_csv` function and the `os` module, import the data from the `new_full_student_data.csv` file, and create a DataFrame called student_df. 

2. Use the head function to confirm that Pandas properly imported the data.

In [50]:
# Create the path and import the data
full_student_data = os.path.join('new_student_data.csv')
student_df = pd.read_csv(full_student_data)
student_df

,student_id,student_name,grade,school_name,reading_score,math_score,school_type
0,127008367,Sarah Douglas,11th,Chang High School,87.2,64.1,Public
1,33365505,Francisco Osborne,9th,Fisher High School,NaN,NaN,Public
2,44359500,Ryan Haas,12th,Campbell High School,91.6,54.7,Public
3,24791243,Kathryn Mack,11th,Richard High School,68.9,73.3,Charter
4,121467881,Harold Reynolds,12th,Chang High School,68.7,43.4,Public
...,...,...,...,...,...,...,...
13935,32277979,Kelly Myers,10th,Sullivan High School,62.3,37.9,Public
13936,109412748,Kimberly Burke,10th,Montgomery High School,99.5,89.8,Public
13937,16856426,Crystal Merritt,9th,Turner High School,86.3,71.1,Public
13938,88213835,Misty Wiggins,10th,Fisher High School,75.4,76.4,Public
13939,12153644,Michele Jones,11th,Chang High School,69.0,72.4,Public

In [51]:
# Verify that the data was properly imported
student_df.head()

# Student_df.tail()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type
0,127008367,Sarah Douglas,11th,Chang High School,87.2,64.1,Public
1,33365505,Francisco Osborne,9th,Fisher High School,NaN,NaN,Public
2,44359500,Ryan Haas,12th,Campbell High School,91.6,54.7,Public
3,24791243,Kathryn Mack,11th,Richard High School,68.9,73.3,Charter
4,121467881,Harold Reynolds,12th,Chang High School,68.7,43.4,Public

## Deliverable 2: Prepare the Data

To prepare and clean your data for analysis, complete the following steps:
    
1. Check for and remove all rows with `NaN`, or missing, values in the student DataFrame. 

2. Check for and remove all duplicate rows in the student DataFrame.

3. Use the `str.replace` function to remove the "th" from the grade levels in the grade column.

4. Check data types using the `dtypes` property.

5. Remove the "th" suffix from every value in the grade column using `str` and `replace`.

6. Change the grade colum to the `int` type and verify column types.

7. Use the head (and/or the tail) function to preview the DataFrame.

In [52]:
# Check for null values
student_df.isna().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1414
math_score        705
school_type         0
dtype: int64

In [53]:
# Drop rows with null values and verify removal
student_df = student_df.dropna(how='all')
student_df.isna().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1414
math_score        705
school_type         0
dtype: int64

In [54]:
# Check for duplicated rows
student_df.duplicated().sum()

1549

In [55]:
# Drop duplicated rows and verify removal
student_df = student_df.drop_duplicates()

In [56]:
# Check data types
student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
dtype: object

In [57]:
# Examine the grade column to understand why it is not an int
student_df['grade']
# The th is causing it to be an object.

0        11th
1         9th
2        12th
3        11th
4        12th
         ...
13935    10th
13936    10th
13937     9th
13938    10th
13939    11th
Name: grade, Length: 12391, dtype: object

In [58]:
# Remove the non-numeric characters and verify the contents of the column
student_df['grade'] = student_df['grade'].str.replace('th', '')

In [59]:
# Change the grade column to the int type and verify column types
student_df['grade'] = student_df['grade'].astype(int)
student_df.dtypes

student_id         int64
student_name      object
grade              int64
school_name       object
reading_score    float64
math_score       float64
school_type       object
dtype: object

## Deliverable 3: Summarize the Data

Describe the data using summary statistics on the data as a whole and on individual columns.

1. Generate the summary statistics for each DataFrame by using the `describe` function.

2. Display the mean math score using the `mean` function. 

2. Store the minimum reading score as `min_reading_score`.

In [60]:
# Display summary statistics for the DataFrame
student_df.describe()

         student_id         grade  reading_score    math_score
count  1.239100e+04  12391.000000   11152.000000  11771.000000
mean   6.970543e+07     10.562505      75.283411     64.399422
std    3.471789e+07      1.128018      14.272937     16.679583
min    1.000132e+07      9.000000       9.500000      1.400000
25%    3.967347e+07     10.000000      65.900000     52.800000
50%    7.005763e+07     11.000000      76.400000     65.100000
75%    9.981476e+07     12.000000      86.300000     76.500000
max    1.299997e+08     12.000000     100.000000    100.000000

In [61]:
# Display the mean math score using the mean function
student_df.mean()

/var/folders/50/glznch0579vbxddqhnfkwnk40000gn/T/ipykernel_4887/969459584.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  student_df.mean()

student_id       6.970543e+07
grade            1.056251e+01
reading_score    7.528341e+01
math_score       6.439942e+01
dtype: float64

In [62]:
# Store the minimum reading score as min_reading_score
min_math_score = student_df['math_score'].min()
min_math_score

1.4

## Deliverable 4: Drill Down into the Data

Drill down to specific rows, columns, and subsets of the data.

To drill down into the data, complete the following steps:

1. Use `loc` to display the grade column.

2. Use `iloc` to display the first 3 rows and columns 3, 4, and 5.

3. Show the rows for grade nine using `loc`.

4. Store the row with the minimum overall reading score as `min_reading_row` using `loc` and the `min_reading_score` found in Deliverable 3.

5. Find the reading scores for the school and grade from the output of step three using `loc` with multiple conditional statements.

6. Using conditional statements and `loc` or `iloc`, find the mean reading score for all students in grades 11 and 12 combined.

In [63]:
# Use loc to display the grade column
student_df.loc[:, "grade"]

0        11
1         9
2        12
3        11
4        12
         ..
13935    10
13936    10
13937     9
13938    10
13939    11
Name: grade, Length: 12391, dtype: int64

In [64]:
# Use `iloc` to display the first 3 rows and columns 3, 4, and 5.
student_df.iloc[0:3, [3,4,5]]

            school_name  reading_score  math_score
0     Chang High School           87.2        64.1
1    Fisher High School            NaN         NaN
2  Campbell High School           91.6        54.7

In [65]:
# Select the rows for grade nine and display their summary statistics using `loc` and `describe`.
grade_df = student_df.loc[student_df["grade"] == 9]
grade_df.describe()

         student_id   grade  reading_score   math_score
count  2.975000e+03  2975.0    2671.000000  2829.000000
mean   6.998373e+07     9.0      77.784051    68.950548
std    3.482410e+07     0.0      13.140330    16.197699
min    1.002379e+07     9.0      19.900000    10.000000
25%    3.965951e+07     9.0      69.700000    58.700000
50%    7.013102e+07     9.0      79.100000    70.700000
75%    1.003026e+08     9.0      87.900000    80.500000
max    1.299257e+08     9.0     100.000000   100.000000

In [66]:
# Store the row with the minimum overall reading score as `min_reading_row`
# using `loc` and the `min_reading_score` found in Deliverable 3.
min_reading_score = student_df["reading_score"].min()
min_reading_row = student_df.loc[student_df["reading_score"] == min_reading_score]
min_reading_row

,student_id,student_name,grade,school_name,reading_score,math_score,school_type
3630,101306483,Colleen Chapman,10,Richard High School,9.5,46.7,Charter

In [67]:
# Use loc with conditionals to select all reading scores from 10th graders at Dixon High School.
reading_scores = student_df.loc[(student_df['school_name'] == 'Dixon High School') & (student_df['grade'] == 10), ['school_name', 'grade', 'reading_score']]
# reading_scores = reading_scores.loc[(student_df['grade'] == 10), ['school_name', 'grade', 'reading_score']]
reading_scores

             school_name  grade  reading_score
254    Dixon High School     10           43.0
655    Dixon High School     10           38.7
3396   Dixon High School     10           67.9
6626   Dixon High School     10           61.4
7256   Dixon High School     10            NaN
8837   Dixon High School     10           54.1
10262  Dixon High School     10           78.4
10707  Dixon High School     10           87.3
11607  Dixon High School     10           70.5
12526  Dixon High School     10           82.9
13772  Dixon High School     10           85.7

In [68]:
# Find the mean reading score for all students in grades 11 and 12 combined.
reading_scores = student_df.loc[(student_df['grade'] == 11) & (student_df['grade'] == 12), ['reading_score']].mean()
reading_scores

reading_score   NaN
dtype: float64

In [69]:
student_df

,student_id,student_name,grade,school_name,reading_score,math_score,school_type
0,127008367,Sarah Douglas,11,Chang High School,87.2,64.1,Public
1,33365505,Francisco Osborne,9,Fisher High School,NaN,NaN,Public
2,44359500,Ryan Haas,12,Campbell High School,91.6,54.7,Public
3,24791243,Kathryn Mack,11,Richard High School,68.9,73.3,Charter
4,121467881,Harold Reynolds,12,Chang High School,68.7,43.4,Public
...,...,...,...,...,...,...,...
13935,32277979,Kelly Myers,10,Sullivan High School,62.3,37.9,Public
13936,109412748,Kimberly Burke,10,Montgomery High School,99.5,89.8,Public
13937,16856426,Crystal Merritt,9,Turner High School,86.3,71.1,Public
13938,88213835,Misty Wiggins,10,Fisher High School,75.4,76.4,Public
13939,12153644,Michele Jones,11,Chang High School,69.0,72.4,Public

## Deliverable 5: Make Comparisons Between District and Charter Schools

Compare district vs charter schools for budget, size, and scores.

Make comparisons within your data by completing the following steps:

1. Using the `groupby` and `mean` functions, look at the average reading and math scores per school type.

1. Using the `groupby` and `count` functions, find the total number of students at each school.

2. Using the `groupby` and `mean` functions, find the average budget per grade for each school type.

In [70]:
# Use groupby and mean to find the average reading and math scores for each school type.

avg_scores = student_df.loc[:,['reading_score', 'school_type', 'math_score']].groupby(by='school_type').mean()
avg_scores

             reading_score  math_score
school_type
Charter          71.774806   61.650401
Public           75.742354   64.762416

In [74]:
# Use the `groupby`, `count`, and `sort_values` functions to find the
# total number of students at each school and sort from most students to least students.
total_students = student_df[['school_name','student_id']].groupby(by=['school_name']).count()
total_students = total_students.sort_values(by=['student_id'],ascending=[False])
total_students = total_students.rename(columns={'student_id':'Student_Count'})
total_students

                        Student_Count
school_name
Turner High School               2493
Fisher High School               2468
Richard High School              1316
Chang High School                1131
Campbell High School             1097
Montgomery High School            803
Campos High School                618
Green High School                 560
Silva High School                 484
Bowers High School                471
Wagner High School                366
Sullivan High School              164
Odonnell High School              160
Woods High School                 138
Dixon High School                 122

In [72]:
#Find the average math score by grade for each school type by using the groupby and mean functions

# Deliverable 6: Summarize Your Findings
In the cell below, write a few sentences to describe any discoveries you made while performing your analysis along with any additional analysis you believe would be worthwhile.

ACROSS THE PUBLIC AND CHARTER SCHOOLS READING AND MATH SCORE ARE ONLY A FEW NUMERICAL VALUES FROM ONE ANOTHER. TURNER HIGH SCHOOL CONTAINS THE MOST STUDENTS.